In [2]:
#Loading data as a data frame and exploring 

#Data sets
#Drinks Dataset, can be downloaded from here:https://www.kaggle.com/navneethc/drinks#drinks.csv
#UFO dataset, download the scrubbed one here: https://raw.githubusercontent.com/justmarkham/DAT8/master/data/ufo.csv
#users dataset, https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user

In [31]:
import os as os
print("Current Working Directory " , os.getcwd())

Current Working Directory  C:\Users\v m kishore\OneDrive\D A T A

In [7]:
path='C:/Users/v m kishore/OneDrive/D A T A'
os.chdir(path)
print("Current Working Directory " , os.getcwd())

Current Working Directory  C:\Users\v m kishore\OneDrive\D A T A

In [8]:
import pandas as pd
#Reading flat file and indexing 
# can read a file from local computer or directly from a URL
#pd.read_table('u.user')
users=pd.read_table('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep='|', index_col='user_id')

In [9]:
#Using data frame methods
# examine the users data
users.head(10)                   # print the first 30 and last 30 rows

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703

In [10]:
type(users)             # DataFrame

pandas.core.frame.DataFrame

In [11]:
users.head()            # print the first 5 rows

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [12]:
users.head(10)          # print the first 10 rows

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703

In [13]:
users.tail()            # print the last 5 rows

         age gender     occupation zip_code
user_id
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

In [14]:
users.index             # "the index" (aka "the labels")

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

In [15]:
users.columns           # column names (which is "an index")

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [16]:
users.dtypes            # data types of each column

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [17]:
users.shape             # number of rows and columns

(943, 4)

In [18]:
users.values            # underlying numpy array

array([[24, 'M', 'technician', '85711'],
       [53, 'F', 'other', '94043'],
       [23, 'M', 'writer', '32067'],
       ...,
       [20, 'M', 'student', '97229'],
       [48, 'F', 'librarian', '78209'],
       [22, 'M', 'student', '77841']], dtype=object)

In [19]:
# select a column
users['gender'][0:10]

user_id
1     M
2     F
3     M
4     M
5     F
6     M
7     M
8     M
9     M
10    M
Name: gender, dtype: object

In [20]:
type(users['gender'])   # Series

pandas.core.series.Series

In [21]:
users.gender.head()            # select one column using the DataFrame attribute

user_id
1    M
2    F
3    M
4    M
5    F
Name: gender, dtype: object

In [22]:
# summarize (describe) the DataFrame
users.describe()                    # describe all numeric columns

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

In [23]:
users.describe(include=['object'])  # describe all object columns

       gender occupation zip_code
count     943        943      943
unique      2         21      795
top         M    student    55414
freq      670        196        9

In [160]:
users.describe(include='all')       # describe all columns

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

In [161]:
# summarize a Series
users.gender.describe()             # describe a single column

count     943
unique      2
top         M
freq      670
Name: gender, dtype: object

In [162]:
users.age.mean()                    # only calculate the mean

34.05196182396607

In [163]:
# count the number of occurrences of each value
users.gender.value_counts()     # most useful for categorical variables

M    670
F    273
Name: gender, dtype: int64

In [208]:
users.age.value_counts().head()        # can also be used with numeric variables

30    39
25    38
22    37
28    36
27    35
Name: age, dtype: int64

In [207]:
# detecting duplicate rows(less frequently used )
users.duplicated().head()          # True if a row is identical to a previous row

user_id
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [166]:
users.duplicated().sum()    # count of duplicates

7

In [168]:
users[users.duplicated()]   # only show duplicates

         age gender occupation zip_code
user_id
496       21      F    student    55414
572       51      M   educator    20003
621       17      M    student    60402
684       28      M    student    55414
733       44      F      other    60630
805       27      F      other    20009
890       32      M    student    97301

In [172]:
users.age.duplicated().head()   # check a single column for duplicates

user_id
1    False
2    False
3    False
4     True
5    False
Name: age, dtype: bool

In [173]:
users.duplicated(['age', 'gender', 'zip_code']).sum()   # specify columns for finding duplicates

13

In [ ]:
# read 'u.user' into 'users'
users = pd.read_table('u.user', sep='|', index_col='user_id')

In [174]:
# BONUS: display only the number of rows of the 'users' DataFrame
users.shape[0]

943

In [209]:
# BONUS: display the 3 most frequent occupations in 'users'
users.occupation.value_counts().head(3)
users.occupation.value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
doctor             7
homemaker          7
Name: occupation, dtype: int64

In [178]:
users.occupation.value_counts()[:3]

student     196
other       105
educator     95
Name: occupation, dtype: int64

In [ ]:
# BONUS: create the 'users' DataFrame from the u.user_original file (which lacks a header row)
# Hint: read the pandas.read_table documentation
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']

In [ ]:
users = pd.read_table('u.user_original', sep='|', header=None, names=user_cols, index_col='user_id')

In [179]:
# for each occupation, calculate the mean age
users.groupby('occupation').age.mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

In [180]:
# BONUS: for each occupation, calculate the minimum and maximum ages
users.groupby('occupation').age.agg(['min', 'max'])

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70
entertainment   15   50
executive       22   69
healthcare      22   62
homemaker       20   50
lawyer          21   53
librarian       23   69
marketing       24   55
none            11   55
other           13   64
programmer      20   63
retired         51   73
salesman        18   66
scientist       23   55
student          7   42
technician      21   55
writer          18   60

In [181]:
# BONUS: for each combination of occupation and gender, calculate the mean age
users.groupby(['occupation', 'gender']).age.mean()

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

In [186]:
# determine unique values in a column
users.occupation.nunique()      # count the number of unique values

21

In [187]:
users.occupation.unique()       # return the unique values

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

In [188]:
#Sub-setting based on column (categorical numerical)value, concat & Sorting 
#boolean filtering: only show users with age < 20
young_bool = users.age < 20    		# create a Series of booleans...
young_bool[1:20]

user_id
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
Name: age, dtype: bool

In [190]:
users[young_bool].head()              		# ...and use that Series to filter rows

         age gender occupation zip_code
user_id
30         7      M    student    55436
36        19      F    student    93117
52        18      F    student    55105
57        16      M       none    84010
67        17      M    student    60402

In [191]:
users[users.age < 20].head()          		# or, combine into a single step

         age gender occupation zip_code
user_id
30         7      M    student    55436
36        19      F    student    93117
52        18      F    student    55105
57        16      M       none    84010
67        17      M    student    60402

In [192]:
users[users.age < 20].occupation.head() 		# select one column from the filtered results

user_id
30    student
36    student
52    student
57       none
67    student
Name: occupation, dtype: object

In [193]:
users[users.age < 20].occupation.value_counts() # value_counts of resulting Series

student          64
other             4
none              3
writer            2
entertainment     2
salesman          1
artist            1
Name: occupation, dtype: int64

In [196]:
# boolean filtering with multiple conditions
users[(users.age < 20) & (users.gender=='M')].head(10)      # ampersand for AND condition

         age gender     occupation zip_code
user_id
30         7      M        student    55436
57        16      M           none    84010
67        17      M        student    60402
68        19      M        student    22904
101       15      M        student    05146
110       19      M        student    77840
142       13      M          other    48118
179       15      M  entertainment    20755
221       19      M        student    20685
246       19      M        student    28734

In [197]:
users[(users.age < 20) | (users.age > 60)].head(5)         # pipe for OR condition

         age gender occupation zip_code
user_id
30         7      M    student    55436
36        19      F    student    93117
52        18      F    student    55105
57        16      M       none    84010
67        17      M    student    60402

In [203]:
users.sort_values('age').head()                   # sort a DataFrame by a single column

         age gender occupation zip_code
user_id
30         7      M    student    55436
471       10      M    student    77459
289       11      M       none    94619
880       13      M    student    83702
609       13      F    student    55106

In [205]:
users.sort_values('age', ascending=False).head()  # use descending order instead

         age gender     occupation zip_code
user_id
481       73      M        retired    37771
803       70      M  administrator    78212
767       70      M       engineer    00000
860       70      F        retired    48322
585       69      M      librarian    98501

In [44]:
# alternative syntax for boolean filtering (noted as "experimental" in the documentation)
users.query('age < 20')                 # users[users.age < 20]
users.query("age < 20 and gender=='M'") # users[(users.age < 20) & (users.gender=='M')]
users.query('age < 20 or age > 60')     # users[(users.age < 20) | (users.age > 60)]

In [44]:
#Other functions modify or reformat data, like Map,Replace, String, _datetime, astype
# map existing values to a different set of values
users['is_male'] = users.gender.map({'F':0, 'M':1})

In [44]:
# encode strings as integer values (automatically starts at 0)
users['occupation_num'] = users.occupation.factorize()[0]

In [44]:
# BONUS: sort 'users' by 'occupation' and then by 'age' (in a single command)
users.sort(['occupation', 'age'])

In [44]:
# BONUS: filter 'users' to only include doctors and lawyers without using a |
# Hint: read the pandas.Series.isin documentation
users[users.occupation.isin(['doctor', 'lawyer'])]

In [48]:
#reading data with desired columns and sorting and indexing

In [206]:
url = 'http://archive.ics.uci.edu/ml/machine-learning-databases/glass/glass.data'
col_names = ['id','ri','na','mg','al','si','k','ca','ba','fe','glass_type']
glass = pd.read_csv(url, names=col_names, index_col='id')
glass.sort_values('al', inplace=True)
glass.head()

          ri     na    mg    al     si     k     ca   ba    fe  glass_type
id
22   1.51966  14.77  3.75  0.29  72.02  0.03   9.00  0.0  0.00           1
185  1.51115  17.38  0.00  0.34  75.41  0.00   6.65  0.0  0.00           6
40   1.52213  14.21  3.82  0.47  71.77  0.11   9.57  0.0  0.00           1
39   1.52213  14.21  3.82  0.47  71.77  0.11   9.57  0.0  0.00           1
51   1.52320  13.72  3.72  0.51  71.75  0.09  10.06  0.0  0.16           1

In [44]:
#Accessing data frame just like a matrix

In [24]:
#loading ufo data
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/ufo.csv'
ufo = pd.read_csv(url)
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [44]:
# select multiple columns
my_cols = ['City', 'State']     # create a list of column names...
ufo[my_cols]                    # ...and use that list to select columns

In [26]:
ufo[['City', 'State']].head()          # or, combine into a single step

                   City State
0                Ithaca    NY
1           Willingboro    NJ
2               Holyoke    CO
3               Abilene    KS
4  New York Worlds Fair    NY

In [44]:
# use loc to select columns by name
ufo.loc[:, 'City']              # colon means "all rows", then select one column
ufo.loc[:, ['City', 'State']]   # select two columns
ufo.loc[:, 'City':'State']      # select a range of columns

# loc can also filter rows by "name" (the index)
ufo.loc[0, :]                   # row 0, all columns
ufo.loc[0:2, :]                 # rows 0/1/2, all columns
ufo.loc[0:2, 'City':'State']    # rows 0/1/2, range of columns

# use iloc to filter rows and select columns by integer position
ufo.iloc[:, [0, 3]]             # all rows, columns in position 0/3
ufo.iloc[:, 0:4]                # all rows, columns in position 0/1/2/3
ufo.iloc[0:3, :]                # rows in position 0/1/2, all columns

In [44]:
# replace any spaces in the column names with an underscore
ufo.rename(columns={'Colors Reported':'Colors_Reported', 'Shape Reported':'Shape_Reported'}, inplace=True)

In [44]:
# BONUS: redo the task above, writing generic code to replace spaces with underscores
# In other words, your code should not reference the specific column names
ufo.columns = [col.replace(' ', '_') for col in ufo.columns]
ufo.columns = ufo.columns.str.replace(' ', '_')

In [44]:
# BONUS: create a new column called 'Location' that includes both City and State
# For example, the 'Location' for the first row would be 'Ithaca, NY'
ufo['Location'] = ufo.City + ', ' + ufo.State

In [229]:
# replace all instances of a value in a column (must match entire value)
ufo.state.replace('tx', 'TX', inplace=True)
ufo.head()

           datetime                  city state country     shape
0  10-10-1949 20:30            san marcos    TX      us  cylinder
1  10-10-1949 21:00          lackland afb    TX     NaN     light
2  10-10-1955 17:00  chester (uk/england)   NaN      gb    circle
3  10-10-1956 21:00                  edna    TX      us    circle
4  10-10-1960 20:00               kaneohe    hi      us     light

In [44]:
# string methods are accessed via 'str'
ufo.State.str.upper()                               # converts to uppercase
ufo.Colors_Reported.str.contains('RED', na='False') # checks for a substring

# convert a string to the datetime format
ufo['Time'] = pd.to_datetime(ufo.Time)
ufo.Time.dt.hour                        # datetime format exposes convenient attributes
(ufo.Time.max() - ufo.Time.min()).days  # also allows you to do datetime "math"
ufo[ufo.Time > pd.datetime(2014, 1, 1)] # boolean filtering with datetime format
# setting and then removing an index
ufo.set_index('Time', inplace=True)
ufo.reset_index(inplace=True)

# sort a column by its index
ufo.State.value_counts().sort_index()

# display the memory usage of a DataFrame
ufo.info()          # total usage
ufo.memory_usage()  # usage by column

# change a Series to the 'category' data type (reduces memory usage and increases performance)
ufo['State'] = ufo.State.astype('category')

In [44]:
#initializing and updating specific values in DF
movies['year'] = -1   Updates all values in column years of movies DF as -1
movies.loc[0, 'year'] = 1994  Updates first row value in column year of movies DF as -1

In [44]:
# create dummy variables for 'continent' and exclude first dummy column
continent_dummies = pd.get_dummies(drinks.continent, prefix='cont').iloc[:, 1:]

In [49]:
#Creating data frames from other data types 
# create a DataFrame from a dictionary
pd.DataFrame({'capital':['Montgomery', 'Juneau', 'Phoenix'], 'state':['AL', 'AK', 'AZ']})

      capital state
0  Montgomery    AL
1      Juneau    AK
2     Phoenix    AZ

In [50]:
# create a DataFrame from a list of lists
pd.DataFrame([['Montgomery', 'AL'], ['Juneau', 'AK'], ['Phoenix', 'AZ']], columns=['capital', 'state'])

      capital state
0  Montgomery    AL
1      Juneau    AK
2     Phoenix    AZ

In [51]:
# display a cross-tabulation of two Series
pd.crosstab(users.occupation, users.gender)

gender          F    M
occupation
administrator  36   43
artist         13   15
doctor          0    7
educator       26   69
engineer        2   65
entertainment   2   16
executive       3   29
healthcare     11    5
homemaker       6    1
lawyer          2   10
librarian      29   22
marketing      10   16
none            4    5
other          36   69
programmer      6   60
retired         1   13
salesman        3    9
scientist       3   28
student        60  136
technician      1   26
writer         19   26

In [32]:
drinks=pd.read_csv('drinks.csv')

In [33]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

In [34]:
# temporarily define a new column as a function of existing columns
# replace all column names
drink_cols = ['country', 'beer', 'spirit', 'wine', 'liters', 'continent']
drinks.columns = drink_cols
new_drinks=drinks.assign(servings = drinks.beer + drinks.spirit + drinks.wine)
new_drinks.head()

       country  beer  spirit  wine  liters continent  servings
0  Afghanistan     0       0     0     0.0        AS         0
1      Albania    89     132    54     4.9        EU       275
2      Algeria    25       0    14     0.7        AF        39
3      Andorra   245     138   312    12.4        EU       695
4       Angola   217      57    45     5.9        AF       319

In [35]:
# print the head and the tail
drinks.head()

       country  beer  spirit  wine  liters continent
0  Afghanistan     0       0     0     0.0        AS
1      Albania    89     132    54     4.9        EU
2      Algeria    25       0    14     0.7        AF
3      Andorra   245     138   312    12.4        EU
4       Angola   217      57    45     5.9        AF

In [36]:
drinks.tail()

       country  beer  spirit  wine  liters continent
188  Venezuela   333     100     3     7.7        SA
189    Vietnam   111       2     1     2.0        AS
190      Yemen     6       0     0     0.1        AS
191     Zambia    32      19     4     2.5        AF
192   Zimbabwe    64      18     4     4.7        AF

In [37]:
# examine the default index, data types, and shape
drinks.index

RangeIndex(start=0, stop=193, step=1)

In [38]:
drinks.dtypes

country       object
beer           int64
spirit         int64
wine           int64
liters       float64
continent     object
dtype: object

In [39]:
drinks.shape

(193, 6)

In [40]:
# print the 'beer_servings' Series
drinks['beer'].head()

0      0
1     89
2     25
3    245
4    217
Name: beer, dtype: int64

In [41]:
drinks.beer.head()

0      0
1     89
2     25
3    245
4    217
Name: beer, dtype: int64

In [42]:
# calculate the mean 'beer_servings' for the entire dataset
drinks.describe()                   # summarize all numeric columns

             beer      spirit        wine      liters
count  193.000000  193.000000  193.000000  193.000000
mean   106.160622   80.994819   49.450777    4.717098
std    101.143103   88.284312   79.697598    3.773298
min      0.000000    0.000000    0.000000    0.000000
25%     20.000000    4.000000    1.000000    1.300000
50%     76.000000   56.000000    8.000000    4.200000
75%    188.000000  128.000000   59.000000    7.200000
max    376.000000  438.000000  370.000000   14.400000

In [43]:
drinks.beer.describe()     # summarize only the 'beer_servings' Series

count    193.000000
mean     106.160622
std      101.143103
min        0.000000
25%       20.000000
50%       76.000000
75%      188.000000
max      376.000000
Name: beer, dtype: float64

In [44]:
drinks.beer.mean()         # only calculate the mean

106.16062176165804

In [45]:
# Count the number of occurrences of each 'continent' value and see if it looks correct
drinks.continent.value_counts()

AF    53
EU    45
AS    44
OC    16
SA    12
Name: continent, dtype: int64

In [46]:
# for each continent, calculate the mean beer servings
drinks.groupby('continent').beer.mean()

continent
AF     61.471698
AS     37.045455
EU    193.777778
OC     89.687500
SA    175.083333
Name: beer, dtype: float64

In [47]:
# for each continent, count the number of occurrences
drinks.continent.value_counts()

AF    53
EU    45
AS    44
OC    16
SA    12
Name: continent, dtype: int64

In [48]:
# for each continent, describe beer servings
drinks.groupby('continent').beer.describe()

           count        mean        std   min     25%    50%     75%    max
continent
AF          53.0   61.471698  80.557816   0.0   15.00   32.0   76.00  376.0
AS          44.0   37.045455  49.469725   0.0    4.25   17.5   60.50  247.0
EU          45.0  193.777778  99.631569   0.0  127.00  219.0  270.00  361.0
OC          16.0   89.687500  96.641412   0.0   21.00   52.5  125.75  306.0
SA          12.0  175.083333  65.242845  93.0  129.50  162.5  198.00  333.0

In [49]:
# similar, but outputs a DataFrame and can be customized
drinks.groupby('continent').beer.agg(['count', 'mean', 'min', 'max'])

           count        mean  min  max
continent
AF            53   61.471698    0  376
AS            44   37.045455    0  247
EU            45  193.777778    0  361
OC            16   89.687500    0  306
SA            12  175.083333   93  333

In [50]:
drinks.groupby('continent').beer.agg(['count', 'mean', 'min', 'max']).sort_values('mean')

           count        mean  min  max
continent
AS            44   37.045455    0  247
AF            53   61.471698    0  376
OC            16   89.687500    0  306
SA            12  175.083333   93  333
EU            45  193.777778    0  361

In [51]:
# if you don't specify a column to which the aggregation function should be applied,
# it will be applied to all numeric columns
drinks.groupby('continent').mean()

                 beer      spirit        wine    liters
continent
AF          61.471698   16.339623   16.264151  3.007547
AS          37.045455   60.840909    9.068182  2.170455
EU         193.777778  132.555556  142.222222  8.617778
OC          89.687500   58.437500   35.625000  3.381250
SA         175.083333  114.750000   62.416667  6.308333

In [52]:
drinks.groupby('continent').describe()

           beer                                                             \
          count        mean        std   min     25%    50%     75%    max
continent
AF         53.0   61.471698  80.557816   0.0   15.00   32.0   76.00  376.0
AS         44.0   37.045455  49.469725   0.0    4.25   17.5   60.50  247.0
EU         45.0  193.777778  99.631569   0.0  127.00  219.0  270.00  361.0
OC         16.0   89.687500  96.641412   0.0   21.00   52.5  125.75  306.0
SA         12.0  175.083333  65.242845  93.0  129.50  162.5  198.00  333.0

          liters            ...    spirit         wine                         \
           count      mean  ...       75%    max count        mean        std
continent                   ...
AF          53.0  3.007547  ...     19.00  152.0  53.0   16.264151  38.846419
AS          44.0  2.170455  ...     98.00  326.0  44.0    9.068182  21.667034
EU          45.0  8.617778  ...    173.00  373.0  45.0  142.222222  97.421738
OC          16.0  3.381250  ...     65.25  254.0  16.0   35.625000  64.555790
SA          12.0  6.308333  ...    148.75  302.0  12.0   62.416667  88.620189


           min   25%    50%     75%    max
continent
AF         0.0   1.0    2.0   13.00  233.0
AS         0.0   0.0    1.0    8.00  123.0
EU         0.0  59.0  128.0  195.00  370.0
OC         0.0   1.0    8.5   23.25  212.0
SA         1.0   3.0   12.0   98.50  221.0

[5 rows x 32 columns]

In [53]:
#Filter 'drinks' to only include European countries
drinks[drinks.continent=='EU'].head()

       country  beer  spirit  wine  liters continent
1      Albania    89     132    54     4.9        EU
3      Andorra   245     138   312    12.4        EU
7      Armenia    21     179    11     3.8        EU
9      Austria   279      75   191     9.7        EU
10  Azerbaijan    21      46     5     1.3        EU

In [54]:
# filter 'drinks' to only include European countries with wine_servings > 300
drinks[(drinks.continent=='EU') & (drinks.wine > 300)]

      country  beer  spirit  wine  liters continent
3     Andorra   245     138   312    12.4        EU
61     France   127     151   370    11.8        EU
136  Portugal   194      67   339    11.0        EU

In [55]:
# calculate the mean 'beer_servings' for all of Europe
drinks[drinks.continent=='EU'].beer.mean()

193.77777777777777

In [56]:
# determine which 10 countries have the highest total_litres_of_pure_alcohol
drinks.sort_values('liters').tail(10)

                country  beer  spirit  wine  liters continent
99           Luxembourg   236     133   271    11.4        EU
155            Slovakia   196     293   116    11.4        EU
81              Ireland   313     118   165    11.4        EU
141  Russian Federation   247     326    73    11.5        AS
61               France   127     151   370    11.8        EU
45       Czech Republic   361     170   134    11.8        EU
68              Grenada   199     438    28    11.9       NaN
3               Andorra   245     138   312    12.4        EU
98            Lithuania   343     244    56    12.9        EU
15              Belarus   142     373    42    14.4        EU

In [57]:
# concatenate two DataFrames (axis=0 for rows, axis=1 for columns)
drinks = pd.concat([drinks, drinks], axis=1)

In [58]:
#merging data frames
A = pd.DataFrame({'color': ['green', 'yellow', 'red'], 'num':[1, 2, 3]})
B = pd.DataFrame({'color': ['green', 'yellow', 'pink'], 'size':['S', 'M', 'L']})

In [59]:
# ### Inner join
# 
# Only include observations found in both A and B:
pd.merge(A, B, how='inner')

    color  num size
0   green    1    S
1  yellow    2    M

In [60]:
# ### Outer join
# 
# Include observations found in either A or B:
pd.merge(A, B, how='outer')

    color  num size
0   green  1.0    S
1  yellow  2.0    M
2     red  3.0  NaN
3    pink  NaN    L

In [61]:
# ### Left join
# 
# Include all observations found in A:
pd.merge(A, B, how='left')

    color  num size
0   green    1    S
1  yellow    2    M
2     red    3  NaN

In [62]:
# ### Right join
# 
# Include all observations found in B:
pd.merge(A, B, how='right')

    color  num size
0   green  1.0    S
1  yellow  2.0    M
2    pink  NaN    L

In [ ]:
#Renaming, Adding, and Removing Columns
# rename one or more columns
drinks.rename(columns={'beer_servings':'beer', 'wine_servings':'wine'})
drinks.rename(columns={'beer_servings':'beer', 'wine_servings':'wine'}, inplace=True)

In [ ]:
# replace all column names
drink_cols = ['country', 'beer', 'spirit', 'wine', 'liters', 'continent']
drinks.columns = drink_cols

In [ ]:
# replace all column names when reading the file
drinks = pd.read_csv('drinks.csv', header=0, names=drink_cols)

In [ ]:
# add a new column as a function of existing columns
drinks['servings'] = drinks.beer + drinks.spirit + drinks.wine
drinks['mL'] = drinks.liters * 1000

In [ ]:
# removing columns
drinks.drop('mL', axis=1)                   # axis=0 for rows, 1 for columns
drinks.drop(['mL', 'servings'], axis=1, inplace=True)   # drop multiple columns

#Handling Missing Values and updating data based on condition

In [262]:
# missing values are usually excluded by default
drinks.continent.value_counts()              # excludes missing values

AF    53
EU    45
AS    44
OC    16
SA    12
Name: continent, dtype: int64

In [263]:
drinks.continent.value_counts(dropna=False)  # includes missing values

AF     53
EU     45
AS     44
NaN    23
OC     16
SA     12
Name: continent, dtype: int64

In [264]:
# find missing values in a Series
drinks.continent.isnull().head()           # True if missing

0    False
1    False
2    False
3    False
4    False
Name: continent, dtype: bool

In [265]:
drinks.continent.notnull().head()          # True if not missing

0    True
1    True
2    True
3    True
4    True
Name: continent, dtype: bool

In [266]:
# use a boolean Series to filter DataFrame rows
drinks[drinks.continent.isnull()]   # only show rows where continent is missing

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
5,Antigua & Barbuda,102.0,128,45,4.9,NaN
11,Bahamas,122.0,176,51,6.3,NaN
14,Barbados,143.0,173,36,6.3,NaN
17,Belize,263.0,114,8,6.8,NaN
32,Canada,240.0,122,100,8.2,NaN
41,Costa Rica,149.0,87,11,4.4,NaN
...,...,...,...,...,...,...
130,Panama,285.0,104,18,7.2,NaN
143,St. Kitts & Nevis,194.0,205,32,7.7,NaN
144,St. Lucia,171.0,315,71,10.1,NaN
145,St. Vincent & the Grenadines,120.0,221,11,6.3,NaN
174,Trinidad & Tobago,197.0,156,7,6.4,NaN
184,USA,249.0,158,84,8.7,NaN

In [267]:
drinks[drinks.continent.notnull()].head()  # only show rows where continent is not missing

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0.0,0,0,0.0,AS
1,Albania,89.0,132,54,4.9,EU
2,Algeria,25.0,0,14,0.7,AF
3,Andorra,245.0,138,312,12.4,EU
4,Angola,217.0,57,45,5.9,AF

In [268]:
# side note: understanding axes
drinks.sum()            # sums "down" the 0 axis (rows)

country                         AfghanistanAlbaniaAlgeriaAndorraAngolaAntigua ...
beer_servings                                                               20489
spirit_servings                                                             15632
wine_servings                                                                9544
total_litres_of_pure_alcohol                                                910.4
dtype: object

In [269]:
drinks.sum(axis=0)      # equivalent (since axis=0 is the default)

country                         AfghanistanAlbaniaAlgeriaAndorraAngolaAntigua ...
beer_servings                                                               20489
spirit_servings                                                             15632
wine_servings                                                                9544
total_litres_of_pure_alcohol                                                910.4
dtype: object

In [270]:
drinks.sum(axis=1)      # sums "across" the 1 axis (columns)

0        0.0
1      279.9
2       39.7
3      707.4
4      324.9
5      279.9
       ...
187     50.9
188    443.7
189    116.0
190      6.1
191     57.5
192     90.7
Length: 193, dtype: float64

In [271]:
# side note: adding booleans
pd.Series([True, False, True])          # create a boolean Series

0     True
1    False
2     True
dtype: bool

In [272]:
pd.Series([True, False, True]).sum()    # converts False to 0 and True to 1

2

In [273]:
# find missing values in a DataFrame
drinks.isnull()             # DataFrame of booleans

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,False,False,False,False,False,False
1,False,False,False,False,False,False
2,False,False,False,False,False,False
3,False,False,False,False,False,False
4,False,False,False,False,False,False
5,False,False,False,False,False,True
...,...,...,...,...,...,...
187,False,False,False,False,False,False
188,False,False,False,False,False,False
189,False,False,False,False,False,False
190,False,False,False,False,False,False
191,False,False,False,False,False,False
192,False,False,False,False,False,False

In [274]:
drinks.isnull().sum()       # count the missing values in each column

country                          0
beer_servings                    0
spirit_servings                  0
wine_servings                    0
total_litres_of_pure_alcohol     0
continent                       23
dtype: int64

In [275]:
# drop missing values
drop_row=drinks.dropna()             # drop a row if ANY values are missing

In [276]:
drop_all_na=drinks.dropna(how='all')    # drop a row only if ALL values are missing

In [277]:
# how many rows remain if you drop all rows with any missing values?
drinks.dropna().shape[0]

170

In [278]:
# fill in missing values
drinks.continent.fillna(value='NA', inplace=True)   # fill in missing values with 'NA'

In [279]:
# turn off the missing value filter
drinks = pd.read_csv('drinks.csv', header=0, names=drink_cols, na_filter=False)

In [253]:
# change the data type of a column
drinks['beer'] = drinks.beer.astype('float')

In [255]:
# change the data type of a column when reading in a file
drinks=pd.read_csv('drinks.csv', dtype={'beer_servings':float})

In [256]:
# write a DataFrame out to a CSV
drinks.to_csv('drinks_updated.csv')                 # index is used as first column

In [257]:
drinks.to_csv('drinks_updated.csv', index=False)    # ignore index

In [258]:
# save a DataFrame to disk (aka 'pickle') and read it from disk (aka 'unpickle')
drinks.to_pickle('drinks_pickle')

In [ ]:
pd.read_pickle('drinks_pickle')

In [259]:
# limit which rows are read when reading in a file
limit_drinks=pd.read_csv('drinks.csv', nrows=10)           # only read first 10 rows

In [260]:
limit_drinks=pd.read_csv('drinks.csv', skiprows=[1, 2])    # skip the first two rows of data

In [261]:
# change the maximum number of rows and columns printed ('None' means unlimited)
pd.set_option('max_rows', 12)     # default is 60 rows
pd.set_option('max_columns', None)  # default is 20 columns
print(drinks)

               country  beer_servings  spirit_servings  wine_servings  \
0          Afghanistan            0.0                0              0
1              Albania           89.0              132             54
2              Algeria           25.0                0             14
3              Andorra          245.0              138            312
4               Angola          217.0               57             45
5    Antigua & Barbuda          102.0              128             45
..                 ...            ...              ...            ...
187            Vanuatu           21.0               18             11
188          Venezuela          333.0              100              3
189            Vietnam          111.0                2              1
190              Yemen            6.0                0              0
191             Zambia           32.0               19              4
192           Zimbabwe           64.0               18              4

     total_litres_of_pure_alcohol continent
0                             0.0        AS
1                             4.9        EU
2                             0.7        AF
3                            12.4        EU
4                             5.9        AF
5                             4.9       NaN
..                            ...       ...
187                           0.9        OC
188                           7.7        SA
189                           2.0        AS
190                           0.1        AS
191                           2.5        AF
192                           4.7        AF

[193 rows x 6 columns]

In [73]:
# reset options to defaults
pd.reset_option('max_rows')
pd.reset_option('max_columns')

In [76]:
# change the options temporarily (settings are restored when you exit the 'with' block)
with pd.option_context('max_rows', 12, 'max_columns', None):
    print(drinks)

               country  beer  spirit  wine  liters continent
0          Afghanistan     0       0     0     0.0        AS
1              Albania    89     132    54     4.9        EU
2              Algeria    25       0    14     0.7        AF
3              Andorra   245     138   312    12.4        EU
4               Angola   217      57    45     5.9        AF
5    Antigua & Barbuda   102     128    45     4.9       NaN
..                 ...   ...     ...   ...     ...       ...
187            Vanuatu    21      18    11     0.9        OC
188          Venezuela   333     100     3     7.7        SA
189            Vietnam   111       2     1     2.0        AS
190              Yemen     6       0     0     0.1        AS
191             Zambia    32      19     4     2.5        AF
192           Zimbabwe    64      18     4     4.7        AF

[193 rows x 6 columns]